app/views/artists/show.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."artist_id" = 4
SELECT COUNT(*) FROM "movies" WHERE "movies"."artist_id" = 1
---
<div id="Films">
  <h2><%= pluralize @artist.movies.size, "Film" %></h2>