app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = 1
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = 1
---
<div id="reviews">
  <h2><%= pluralize @movie.reviews.size, "Review" %></h2>