app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 1
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 1
---
<div id="reviews">
  <h2><%= pluralize @user.reviews.size, "Review" %></h2>

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 17]]
---
    <div class="review">
      <div class="movietitle"> <%= Movie.find(review.movie_id).name %> </div>