app/controllers/movies_controller.rb

  def index
    @search = Movie.search(params[:q])
---
SELECT "movies".* FROM "movies" ORDER BY "movies"."updated_at" DESC

  def show
    @movie = Movie.find(params[:id])

    @user = User.find(session[:user_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]