app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "reviews" ("content", "created_at", "movie_id", "name", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["content", "3rd"], ["created_at", Wed, 20 Feb 2013 22:57:50 UTC +00:00], ["movie_id", 1], ["name", "s"], ["rating", 3], ["updated_at", Wed, 20 Feb 2013 22:57:50 UTC +00:00], ["user_id", 1]]
SELECT AVG("reviews"."rating") AS avg_id FROM "reviews" WHERE (movie_id = '1')
UPDATE "movies" SET "average_rating" = 2.047619047619047, "updated_at" = '2013-02-21 07:35:55.562455' WHERE "movies"."id" = 1
---
  def create
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.create!(params[:review])
    average = Review.average(:rating, :conditions => ['movie_id = ?', params[:movie_id]])
    Movie.update(params[:movie_id], :average_rating => average)