app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "oauth_expires_at", "oauth_token", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @user = User.find(params[:id])

    respond_to do |format|
      if session[:user_id] == @user.id
    	session[:user_id] = nil
        @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]